# Dataframes testing code

In [2]:
import pandas as pd
df = pd.read_csv("Files/DisneylandReviews.csv", encoding="latin-1")
df

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

## Lookgin for data (loc tool)

### loc and iloc can return multiple data

In [3]:
df.head(6)
# Right here we can get the first 6 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
5,670591897,3,2019-4,Singapore,"Have been to Disney World, Disneyland Anaheim ...",Disneyland_HongKong

In [4]:
df.tail(3)
# Right here we can get the last 3 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [5]:
df.loc[[0,40000, 200]] # We can search for Rows, also I can get specific rows
# It has this structure: df.loc[[Rows],[Columns]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
40000,155911904,3,2013-3,United Kingdom,This was our 2nd visit. Kids didn't seem to im...,Disneyland_Paris
200,653385350,5,2019-2,United States,Much smaller than the US versions and you can ...,Disneyland_HongKong

In [6]:
df.loc[[12]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
12,670376905,4,2019-4,Australia,"We spend two days, the second day went early t...",Disneyland_HongKong

In [7]:
df.loc[[1],['Rating']] # We gotta put the name of the column between ''

   Rating
1       4

In [8]:
df.loc[12:20,['Reviewer_Location', 'Rating']] # In this case we didn't had to put the [Row]
# We define the range of the row in the 12:20

   Reviewer_Location  Rating
12         Australia       4
13       Philippines       5
14         Australia       5
15    United Kingdom       3
16   Myanmar (Burma)       4
17    United Kingdom       3
18         Australia       4
19         Hong Kong       5
20    United Kingdom       5

In [9]:
# We can also get every row with the next expression
df.loc[:,['Reviewer_Location', 'Rating']] # With the : we get every row

          Reviewer_Location  Rating
0                 Australia       4
1               Philippines       4
2      United Arab Emirates       4
3                 Australia       4
4            United Kingdom       4
...                     ...     ...
42651        United Kingdom       5
42652                Canada       5
42653          South Africa       5
42654         United States       4
42655        United Kingdom       4

[42656 rows x 2 columns]

In [10]:
df.loc[[0],:] # I got the first row (0) with all their columns

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong

## Looking for data (iloc tool)

In [11]:
# We use iloc for get the columns by their index, not by their name, like...

df.iloc[[0,5,10],[0,2]] # I didn't have to put the name of the column, just the index of the same

    Review_ID Year_Month
0   670772142     2019-4
5   670591897     2019-4
10  670443403     2019-4

In [12]:
df.iloc[0:2,0:4] # I also can look for data without the double [],[]
# I just write the range for the row and the column separating with "," and then i'll get the data
# If i ask for data that doesn't exist, like column 100, but i only have 5, it'll only show the 5

   Review_ID  Rating Year_Month Reviewer_Location
0  670772142       4     2019-4         Australia
1  670682799       4     2019-5       Philippines

## Change indexex

In [13]:
# We also can change the index of the dataframe
df2 = pd.read_csv('Files/DisneylandReviews.csv', encoding="latin-1") # Create a dataframe again
df2.index = df2['Rating']
df2 # As we can see, the index changed to the column 'Rating', a lot of elements have the same index

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
Rating,,,,,,
4,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
4,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
4,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
4,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
5,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
5,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
5,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
4,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
4,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [14]:
# If we use the iloc, then we can access to the data with the number index

df2.iloc[0:2,0:3] # Still works because we used iloc, if we use loc, then
# It wouldn't work, because it would work with the Rating index

        Review_ID  Rating Year_Month
Rating
4       670772142       4     2019-4
4       670682799       4     2019-5

## Change values into the DF

In [15]:
df3 = pd.read_csv('Files/DisneylandReviews.csv', encoding="latin-1") # Create a new DF, to not change other actions
df3 # For example, i would like to change the Reviewer_Location in the index 3 for Colombia

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [16]:
df3.loc[3,["Reviewer_Location"]] = 'Colombia'
df3 # The data change was succesfully

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Colombia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

## Access to a special value

### at and iat it's designed to return only one value

In [17]:
df3.at[3,"Reviewer_Location"] # Then, we can use this function to get a value without a table format, just value

'Colombia'

In [18]:
# If I use the at method, I can get access with the same format [[Rows],[Name of columns]]
# But if we actually use iat then we can access to the value using the numeric value

df3.iat[3,3] # Its the same way, but using index values, we get the value without table format

'Colombia'

### Exercises locating data

In [19]:
# I'll search data that i see in the DF easily
df
# Rn i'll look for the 2nd and 4th row, Rating, Reviewer location and the Branch (table format)

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [20]:
df.loc[[2,4],["Rating", "Reviewer_Location", "Branch"]] # There it is, i just got my data in table format

# Rn i want to get one value in a normal format (using at o iat)

   Rating     Reviewer_Location               Branch
2       4  United Arab Emirates  Disneyland_HongKong
4       4        United Kingdom  Disneyland_HongKong

In [21]:
df.at[4,"Reviewer_Location"]

'United Kingdom'

In [22]:
# Now i'll do the same thing but using the index value

df.iat[4,3] # Great

'United Kingdom'

## Access Data in column forms

In [23]:
# It's so easy, we only call the DF and tell wich column do we want to show in screen
df["Reviewer_Location"]

0                   Australia
1                 Philippines
2        United Arab Emirates
3                   Australia
4              United Kingdom
                 ...
42651          United Kingdom
42652                  Canada
42653            South Africa
42654           United States
42655          United Kingdom
Name: Reviewer_Location, Length: 42656, dtype: object

In [24]:
# Even we can call multiple columns using the next structure

# If it's a multiple query, i'll use [[Here'd go the columns]]
df[["Branch","Reviewer_Location"]] # Even we can put the order as we want it to be 
# Like in this case: Branch first of Reviewer_Location

                    Branch     Reviewer_Location
0      Disneyland_HongKong             Australia
1      Disneyland_HongKong           Philippines
2      Disneyland_HongKong  United Arab Emirates
3      Disneyland_HongKong             Australia
4      Disneyland_HongKong        United Kingdom
...                    ...                   ...
42651     Disneyland_Paris        United Kingdom
42652     Disneyland_Paris                Canada
42653     Disneyland_Paris          South Africa
42654     Disneyland_Paris         United States
42655     Disneyland_Paris        United Kingdom

[42656 rows x 2 columns]

In [25]:
# We can get info doing the structure df.column, but... it doesn't works with the columns that have a couple of strings

df.Branch

0        Disneyland_HongKong
1        Disneyland_HongKong
2        Disneyland_HongKong
3        Disneyland_HongKong
4        Disneyland_HongKong
                ...
42651       Disneyland_Paris
42652       Disneyland_Paris
42653       Disneyland_Paris
42654       Disneyland_Paris
42655       Disneyland_Paris
Name: Branch, Length: 42656, dtype: object

In [26]:
# But if we try getting data like Reviewer_Location it wouldn't work out

df.Reviewer_Location # The tutorial doesn't recommend to use this method to acces to the info

0                   Australia
1                 Philippines
2        United Arab Emirates
3                   Australia
4              United Kingdom
                 ...
42651          United Kingdom
42652                  Canada
42653            South Africa
42654           United States
42655          United Kingdom
Name: Reviewer_Location, Length: 42656, dtype: object

In [27]:
df[['Branch', 'Reviewer_Location', 'Rating']].head()

# We can also use multiple methods, like i did rh, i looked for three columns but, beside that I said that I wanted to 
# See the head of that (the firt five elements)

                Branch     Reviewer_Location  Rating
0  Disneyland_HongKong             Australia       4
1  Disneyland_HongKong           Philippines       4
2  Disneyland_HongKong  United Arab Emirates       4
3  Disneyland_HongKong             Australia       4
4  Disneyland_HongKong        United Kingdom       4

## Organizing info

In [28]:
# Actually we can also change the organization, using sort_values, like the next example

df3.sort_values("Rating", ascending=True) # We can see that the info it's organized by it Rate...

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
1557,547200651,1,2017-12,United Kingdom,I went with my boyfriend for our final day in ...,Disneyland_HongKong
1554,547353083,1,2017-11,United Kingdom,First queued for 45 minuets for opening then a...,Disneyland_HongKong
37097,246032456,1,2014-12,United Kingdom,I wouldn't bother visiting Disneyland Paris ag...,Disneyland_Paris
11039,577213847,1,2018-4,Australia,So! It said 5mins!!!! 20mins have past and sti...,Disneyland_California
37089,246188201,1,2014-12,United Kingdom,"if you are disabled, or with a disabled person...",Disneyland_Paris
...,...,...,...,...,...,...
28,669353396,5,2019-4,United Kingdom,We visited here on a Wednesday. We arrived for...,Disneyland_HongKong
27,669403596,5,2018-12,Philippines,We have been to Hong Kong Disneyland a few tim...,Disneyland_HongKong
24,669783708,5,2019-4,Australia,GO early if you want to do photos with the sig...,Disneyland_HongKong
20,670030877,5,2019-4,United Kingdom,We bought a 2 day tourist ticket via Klook whi...,Disneyland_HongKong
19,670033848,5,2018-11,Hong Kong,There is nothing more to say except that you b...,Disneyland_HongKong

In [29]:
# Practice

# Imma organize the info with multiple parameters
df3.sort_values('Reviewer_Location', ascending=False) # The keyword descending doesn't exist, then we use False for ascending

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
41190,131008559,5,2011-6,Åland Islands,If you ve seen one you ve seen all just ab...,Disneyland_Paris
37355,236876057,5,2014-8,Zimbabwe,the very first thing on my list was a photo wi...,Disneyland_Paris
2891,448889595,4,2016-12,Zimbabwe,Visited end of December with my 7 5 and 4 year...,Disneyland_HongKong
36887,253521894,5,missing,Zambia,Disneyland is not just for kids even adults wo...,Disneyland_Paris
541,628375545,5,2018-10,Zambia,I had awesome fun at Disneyland they had a fun...,Disneyland_HongKong
...,...,...,...,...,...,...
35327,310177640,4,2015-4,Albania,It is a place where you can spend more than a ...,Disneyland_Paris
29552,631585637,5,2018-1,Albania,"the best thing we did, it is a life and money ...",Disneyland_Paris
41353,127614833,5,2012-4,Albania,Don't miss it if you go to Paris. Two Parcs ne...,Disneyland_Paris
36533,266029907,5,2015-3,Afghanistan,I liked that few people visited on the day I w...,Disneyland_Paris
8284,151647044,4,2013-1,Afghanistan,it was smaller than what I expected and heard ...,Disneyland_HongKong

In [30]:
# We can also organize by multiple columns at the same time but then, the ascending changes

# If I want organize multiple columns, we gotta use the structure [[]]
df3.sort_values(['Reviewer_Location', 'Rating'],ascending=[0,5]) # First of all, it organize first by the Reviewer_Location
# After that It organize it by that, then organize by it Rating
# Imma do some more exercises

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
41190,131008559,5,2011-6,Åland Islands,If you ve seen one you ve seen all just ab...,Disneyland_Paris
2891,448889595,4,2016-12,Zimbabwe,Visited end of December with my 7 5 and 4 year...,Disneyland_HongKong
37355,236876057,5,2014-8,Zimbabwe,the very first thing on my list was a photo wi...,Disneyland_Paris
8064,159419951,3,2013-3,Zambia,"I think everyone, given the chance, whats to v...",Disneyland_HongKong
34091,369335429,4,2015-6,Zambia,The children had a great and exciting time at ...,Disneyland_Paris
...,...,...,...,...,...,...
33175,421089809,5,2016-9,Albania,"Two parks to visit, one bigger than another. Y...",Disneyland_Paris
36672,262148376,5,2014-11,Albania,The park opens at 10:00 am.It is worth it an...,Disneyland_Paris
41353,127614833,5,2012-4,Albania,Don't miss it if you go to Paris. Two Parcs ne...,Disneyland_Paris
8284,151647044,4,2013-1,Afghanistan,it was smaller than what I expected and heard ...,Disneyland_HongKong
36533,266029907,5,2015-3,Afghanistan,I liked that few people visited on the day I w...,Disneyland_Paris

In [31]:
df3.sort_values(["Rating", "Reviewer_Location", "Branch"],ascending=[1,1,0])

# We can do a lot of filters: In this case i wanted to organize everything but the branch in ascending order

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
33804,383792230,1,2016-6,Argentina,Unless you are positive about all refurbishin...,Disneyland_Paris
35810,293880609,1,2015-7,Argentina,I m sorry to write this terrible review. But I...,Disneyland_Paris
6457,247334091,1,2015-1,Argentina,No animatronics.. no nothing. The mini castle ...,Disneyland_HongKong
19167,274328859,1,2015-5,Argentina,We were really mad when we find out that we sp...,Disneyland_California
29334,645849892,1,2019-1,Australia,After having a wonderful time 20 years ago in ...,Disneyland_Paris
...,...,...,...,...,...,...
25829,140734267,5,2011-10,Vietnam,Our group spent a whole day to visit Disneylan...,Disneyland_California
36887,253521894,5,missing,Zambia,Disneyland is not just for kids even adults wo...,Disneyland_Paris
541,628375545,5,2018-10,Zambia,I had awesome fun at Disneyland they had a fun...,Disneyland_HongKong
37355,236876057,5,2014-8,Zimbabwe,the very first thing on my list was a photo wi...,Disneyland_Paris
41190,131008559,5,2011-6,Åland Islands,If you ve seen one you ve seen all just ab...,Disneyland_Paris

## Itaration

In [32]:
# We can get access to the data using this tool, but it isn't recommended

# Using a for

for index, row in df3.head().iterrows(): # Even in this case, I used head to not got problems with my long DF
    print(f'{index}')
    print(f'{row}')
    print('\n\n')

# That's it

0
Review_ID                                                    670772142
Rating                                                               4
Year_Month                                                      2019-4
Reviewer_Location                                            Australia
Review_Text          If you've ever been to Disneyland anywhere you...
Branch                                             Disneyland_HongKong
Name: 0, dtype: object



1
Review_ID                                                    670682799
Rating                                                               4
Year_Month                                                      2019-5
Reviewer_Location                                          Philippines
Review_Text          Its been a while since d last time we visit HK...
Branch                                             Disneyland_HongKong
Name: 1, dtype: object



2
Review_ID                                                    670623270
Rating                                                               4
Year_Month                                                      2019-4
Reviewer_Location                                 United Arab Emirates
Review_Text          Thanks God it wasn   t too hot or too humid wh...
Branch                                             Disneyland_HongKong
Name: 2, dtype: object



3
Review_ID                                                    670607911
Rating                                                               4
Year_Month                                                      2019-4
Reviewer_Location                                             Colombia
Review_Text          HK Disneyland is a great compact park. Unfortu...
Branch                                             Disneyland_HongKong
Name: 3, dtype: object



4
Review_ID                                                    670607296
Rating                                                               4
Year_Month                                                      2019-4
Reviewer_Location                                       United Kingdom
Review_Text          the location is not in the city, took around 1...
Branch                                             Disneyland_HongKong
Name: 4, dtype: object

In [33]:
# Even we can get specific info, like a table row, let's see

for index, row in df3.head().iterrows():
    print(index)
    print(row[["Rating", "Branch"]]) # We can even get acces to multiple columns with the structure that we know
    print('\n')

0
Rating                      4
Branch    Disneyland_HongKong
Name: 0, dtype: object


1
Rating                      4
Branch    Disneyland_HongKong
Name: 1, dtype: object


2
Rating                      4
Branch    Disneyland_HongKong
Name: 2, dtype: object


3
Rating                      4
Branch    Disneyland_HongKong
Name: 3, dtype: object


4
Rating                      4
Branch    Disneyland_HongKong
Name: 4, dtype: object

## Filtering Data

In [34]:
# We already saw this example but here we go agai, got the head of the df

df.head() # Get the first 5 elements in the df

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong

In [35]:
# We can even get all the data that we want to
 
df.head(40) # Then we can get acces to my number

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
5,670591897,3,2019-4,Singapore,"Have been to Disney World, Disneyland Anaheim ...",Disneyland_HongKong
6,670585330,5,2019-4,India,Great place! Your day will go by and you won't...,Disneyland_HongKong
7,670574142,3,2019-3,Malaysia,Think of it as an intro to Disney magic for th...,Disneyland_HongKong
8,670571027,2,2019-4,Australia,"Feel so let down with this place,the Disneylan...",Disneyland_HongKong
9,670570869,5,2019-3,India,I can go on talking about Disneyland. Whatever...,Disneyland_HongKong
10,670443403,5,2019-4,United States,Disneyland never cease to amaze me! I've been ...,Disneyland_HongKong
11,670435886,5,2019-4,Canada,We spent the day here with our grown kids and ...,Disneyland_HongKong
12,670376905,4,2019-4,Australia,"We spend two days, the second day went early t...",Disneyland_HongKong
13,670324965,5,2019-4,Philippines,It was indeed the happiest place on earth! My ...,Disneyland_HongKong
14,670274554,5,2018-9,Australia,This place is HUGE! Definately need more than ...,Disneyland_HongKong
15,670205135,3,2019-1,United Kingdom,We brought tickets before we left and got 2 da...,Disneyland_HongKong
16,670199487,4,2019-4,Myanmar (Burma),"Its huge , not enough to visit in one day. We ...",Disneyland_HongKong
17,670129921,3,2019-4,United Kingdom,Around 60 per person and if you want to eat ...,Disneyland_HongKong
18,670099231,4,2019-4,Australia,It s Disneyland! It just does not need revie...,Disneyland_HongKong
19,670033848,5,2018-11,Hong Kong,There is nothing more to say except that you b...,Disneyland_HongKong
20,670030877,5,2019-4,United Kingdom,We bought a 2 day tourist ticket via Klook whi...,Disneyland_HongKong
21,670022335,3,2019-4,United States,First off I'm not a really big Disneyland fan....,Disneyland_HongKong
22,670007081,3,2019-4,United States,Mickey and the Wounderous book was great and t...,Disneyland_HongKong
23,669996858,3,2019-4,Singapore,I ve been to Hong Kong Disneyland twice and ...,Disneyland_HongKong
24,669783708,5,2019-4,Australia,GO early if you want to do photos with the sig...,Disneyland_HongKong
25,669548161,3,2019-4,Hong Kong,Disneylands the world over are generic apart f...,Disneyland_HongKong
26,669528186,3,2019-4,Australia,"This was my second trip here, the first been a...",Disneyland_HongKong
27,669403596,5,2018-12,Philippines,We have been to Hong Kong Disneyland a few tim...,Disneyland_HongKong
28,669353396,5,2019-4,United Kingdom,We visited here on a Wednesday. We arrived for...,Disneyland_HongKong
29,669186152,3,2019-4,Australia,I need to say I have been to home of Disney...,Disneyland_HongKong
30,669093045,5,2019-4,Australia,Took a five year old and a two year old. Could...,Disneyland_HongKong
31,669050447,4,2019-4,Australia,A great day out even for adults.We can early a...,Disneyland_HongKong
32,668819140,5,2019-4,Australia,I went to Hong Kong Disneyland with a little t...,Disneyland_HongKong
33,668798543,5,2019-4,China,This Disneyland is a lot of fun. There are man...,Disneyland_HongKong
34,668777351,4,2018-12,Australia,"We have been to Disneyland in LA two times, an...",Disneyland_HongKong
35,668611003,4,2019-4,Australia,Australian family of four with 2 kids (12 and ...,Disneyland_HongKong
36,668374644,4,2019-4,United Kingdom,If your are travelling to Disney land from mon...,Disneyland_HongKong
37,668242919,4,2019-4,Australia,Hong Kong is easy to get to via the MTR from K...,Disneyland_HongKong
38,668209978,5,2018-9,Australia,You have to visit to understand the memorable ...,Disneyland_HongKong
39,668111738,5,2018-6,Hong Kong,HKDL got different event for different period....,Disneyland_HongKong

In [36]:
# The opposite of the head is the tail

df.tail()

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [37]:
# And also, we can get access to a specific number of data in the tail

df.tail(10)

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
42646,2228738,3,missing,Spain,It's my 4th. visit to disneyland paris and all...,Disneyland_Paris
42647,2216235,2,missing,United States,I would not recommend going if you have been t...,Disneyland_Paris
42648,2192691,5,missing,United States,I've been to Disney in California 5 times. I'v...,Disneyland_Paris
42649,2174555,5,missing,United Kingdom,Disneyland Park Paris is the rolls royce of th...,Disneyland_Paris
42650,1879452,5,missing,United Kingdom,Did the kids free trip last week in March no c...,Disneyland_Paris
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [38]:
# I can know the structure and the type of data that I want to treat with

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42656 entries, 0 to 42655
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Review_ID          42656 non-null  int64
 1   Rating             42656 non-null  int64
 2   Year_Month         42656 non-null  object
 3   Reviewer_Location  42656 non-null  object
 4   Review_Text        42656 non-null  object
 5   Branch             42656 non-null  object
dtypes: int64(2), object(4)
memory usage: 2.0+ MB

In [39]:
# Now, I'll can do the thing that I wanted to do: get access to a specific value/values

# I want to know wich were the Texts (Review_Text) from people from Colombia

# I can have access to that by next way

df.loc[df['Reviewer_Location'] == 'Colombia']

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
758,606117019,3,2018-8,Colombia,The park has some unique attractions that are ...,Disneyland_HongKong
5611,299377614,3,2015-8,Colombia,Its too little. Not that good. Definately choo...,Disneyland_HongKong
10995,579723351,5,2018-5,Colombia,"I went with my wife and my sister, we recommen...",Disneyland_California
11125,573179770,5,2018-2,Colombia,"This place is good for a new experience , the ...",Disneyland_California
13033,478214998,3,2017-4,Colombia,I brought my two daughters (12 & 8) for the th...,Disneyland_California
13822,444647524,1,2016-12,Colombia,"Although we spend almost 10 hours in the park,...",Disneyland_California
16433,343587033,3,2015-12,Colombia,"If you already went to Disney in Orlando, you ...",Disneyland_California
26764,129271302,5,2012-3,Colombia,We havent been able to take our annual trip to...,Disneyland_California
34117,368108478,4,2016-4,Colombia,Many attractions and rides were under repair a...,Disneyland_Paris
35455,305541880,1,2015-3,Colombia,"Even knowing that was not good, because my nep...",Disneyland_Paris
39032,179960012,4,2013-10,Colombia,"It is a good option to hsare with your kids, h...",Disneyland_Paris

In [40]:
# Now i will apply a lil filter, I wanna read the Reviwew_Text completely, then I'll use logics

vec = [758, 5611, 10995, 11125, 13033, 13822, 16433, 26764, 34117, 35455, 39032]

for i in range(len(vec)):
    print(df.iat[vec[i], 4])
    print("\n")

# I made it, i could get access to the data but it is manual, i gotta work with this automatizaded...

The park has some unique attractions that are not in other Disney parks. The staff is rude and never smile. There's not fireworks show.  The parade and the mapping at night is amazing.  The Iron Man atraction is great.


Its too little. Not that good. Definately choose the other hk park that os way better. If you know disney usa this one will dissapoint you


I went with my wife and my sister, we recommend space mountain and the others rides of tomorrow land. Everybody must do the Indiana Jones ride, and never forget the Matterhorn.For eat people can chose between a lot of restaurants, I think the best is zocalo.Every visitor must check the weather before to go, sometimes it   s cold with wind, in these cases a jacket is very important.


This place is good for a new experience , the fantasy make you to feel like a child. And Kids enjoy it very much. Have good choices in food , and drinks. Compare to other parks . Make sure you arrive before door opens to enjoy it all ...


I brought my two daughters (12 & 8) for the third time (prior two in Disney World Orlando. After all these visits, I still feel the  Disney  experience is so so:  long lines: who wants to spend 45 90 min waiting for a 7 min ride?  a lot of things feel rushed and not personalized   FASTPASS was not working in a couple of stations  food and drinks are expensive. We had to eat standing up (not even a piece of grass to sit down and relax)  we really didn't feel as  guests . Neither my wife nor I plan to come back. Based on our experiences, I'm not sure that my daughters look forward to return either. Sorry to spoil the magic!


Although we spend almost 10 hours in the park, we were able to ride only 5 or 6 attractions. We went on a Monday, which should has help with the crowd's. This was my first time to disneyland and my fifth visit to a Walt Disney Property and me and my family had decided not to come back to any of them.


If you already went to Disney in Orlando, you should not go to this park. waste your money in a different park or museum. The best attractions are INdianan jones the ride, the Star Wars ride and its zone, and the dolls from the world. DO not forget to get a pineapple ice cream from dhole , they are so good and I only seen them in Hawaii. The worst attraction ever, is  nemo  looks like an attraction from the 70's, do not worth it.


We havent been able to take our annual trip to DL for several years now, but we're making up for it this year. In our three visits this year, we never seem to be able to fully get our fix. Going in the fall, winter, & early spring, the crowds have never been too bad. The prices are .. Disney prices, which is to be expected. The food has improved some since our last visits. But none of this can touch that warm Disney glow. I just want to take up residence in the park. Cant wait for our next trip.


Many attractions and rides were under repair and this was not properly stated in their website. We felt that we were tricked


Even knowing that was not good, because my nephew wanted to visit the park I decided to visit this vacations and have fun with him. Incredible that an amusement park , specially for kids, allow people to smoke while waiting in line to enter the attractions. Long lines, lot of time waiting as usual, and the staff saw them smoking but never approach even to say you are disturbing the other visitors.


It is a good option to hsare with your kids, however, I recommend the other park (the french one) in the city if you visit Paris, could be more interesting with french style. By the other side, it is expensive, not enough atractions and most of the time were under maintenance or closed due to  technical situations . Restaurant options inside the park are limited and bad quality, ( bad taste and Ex. Hamburgers were cold).Shops are crowded and better options in the ouside shop.

In [41]:
# We define a df that only contains the Reviews of people from Colombia
filtro = df[df["Reviewer_Location"] == "Colombia"]

# Then we just create another one getting the Reviewer text
reviews_colombia = filtro["Review_Text"]

# And finally we iterate every element, that only returns the review
for review in reviews_colombia:
    print(review)
    print("\n")

The park has some unique attractions that are not in other Disney parks. The staff is rude and never smile. There's not fireworks show.  The parade and the mapping at night is amazing.  The Iron Man atraction is great.


Its too little. Not that good. Definately choose the other hk park that os way better. If you know disney usa this one will dissapoint you


I went with my wife and my sister, we recommend space mountain and the others rides of tomorrow land. Everybody must do the Indiana Jones ride, and never forget the Matterhorn.For eat people can chose between a lot of restaurants, I think the best is zocalo.Every visitor must check the weather before to go, sometimes it   s cold with wind, in these cases a jacket is very important.


This place is good for a new experience , the fantasy make you to feel like a child. And Kids enjoy it very much. Have good choices in food , and drinks. Compare to other parks . Make sure you arrive before door opens to enjoy it all ...


I brought my two daughters (12 & 8) for the third time (prior two in Disney World Orlando. After all these visits, I still feel the  Disney  experience is so so:  long lines: who wants to spend 45 90 min waiting for a 7 min ride?  a lot of things feel rushed and not personalized   FASTPASS was not working in a couple of stations  food and drinks are expensive. We had to eat standing up (not even a piece of grass to sit down and relax)  we really didn't feel as  guests . Neither my wife nor I plan to come back. Based on our experiences, I'm not sure that my daughters look forward to return either. Sorry to spoil the magic!


Although we spend almost 10 hours in the park, we were able to ride only 5 or 6 attractions. We went on a Monday, which should has help with the crowd's. This was my first time to disneyland and my fifth visit to a Walt Disney Property and me and my family had decided not to come back to any of them.


If you already went to Disney in Orlando, you should not go to this park. waste your money in a different park or museum. The best attractions are INdianan jones the ride, the Star Wars ride and its zone, and the dolls from the world. DO not forget to get a pineapple ice cream from dhole , they are so good and I only seen them in Hawaii. The worst attraction ever, is  nemo  looks like an attraction from the 70's, do not worth it.


We havent been able to take our annual trip to DL for several years now, but we're making up for it this year. In our three visits this year, we never seem to be able to fully get our fix. Going in the fall, winter, & early spring, the crowds have never been too bad. The prices are .. Disney prices, which is to be expected. The food has improved some since our last visits. But none of this can touch that warm Disney glow. I just want to take up residence in the park. Cant wait for our next trip.


Many attractions and rides were under repair and this was not properly stated in their website. We felt that we were tricked


Even knowing that was not good, because my nephew wanted to visit the park I decided to visit this vacations and have fun with him. Incredible that an amusement park , specially for kids, allow people to smoke while waiting in line to enter the attractions. Long lines, lot of time waiting as usual, and the staff saw them smoking but never approach even to say you are disturbing the other visitors.


It is a good option to hsare with your kids, however, I recommend the other park (the french one) in the city if you visit Paris, could be more interesting with french style. By the other side, it is expensive, not enough atractions and most of the time were under maintenance or closed due to  technical situations . Restaurant options inside the park are limited and bad quality, ( bad taste and Ex. Hamburgers were cold).Shops are crowded and better options in the ouside shop.

#### Practicing

In [47]:
df[df['Rating'] >= 4].sort_values("Reviewer_Location", ascending=False).tail(6)

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
41353,127614833,5,2012-4,Albania,Don't miss it if you go to Paris. Two Parcs ne...,Disneyland_Paris
30534,573729490,5,2017-9,Albania,Eventually all of us think that this is a plac...,Disneyland_Paris
36672,262148376,5,2014-11,Albania,The park opens at 10:00 am.It is worth it an...,Disneyland_Paris
29552,631585637,5,2018-1,Albania,"the best thing we did, it is a life and money ...",Disneyland_Paris
8284,151647044,4,2013-1,Afghanistan,it was smaller than what I expected and heard ...,Disneyland_HongKong
36533,266029907,5,2015-3,Afghanistan,I liked that few people visited on the day I w...,Disneyland_Paris

In [ ]:
df.loc[df['Rating'] >= 4].sort_values("Reviewer_Location", ascending=False).tail(6) # We can get the same data with loc

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
41353,127614833,5,2012-4,Albania,Don't miss it if you go to Paris. Two Parcs ne...,Disneyland_Paris
30534,573729490,5,2017-9,Albania,Eventually all of us think that this is a plac...,Disneyland_Paris
36672,262148376,5,2014-11,Albania,The park opens at 10:00 am.It is worth it an...,Disneyland_Paris
29552,631585637,5,2018-1,Albania,"the best thing we did, it is a life and money ...",Disneyland_Paris
8284,151647044,4,2013-1,Afghanistan,it was smaller than what I expected and heard ...,Disneyland_HongKong
36533,266029907,5,2015-3,Afghanistan,I liked that few people visited on the day I w...,Disneyland_Paris

## Access to specific data